{
  "_index":"qccj-nxwm-etsk-niuu",
  "_type":"post",
  "_id":"77297",
  "_version":5,
  "found":true,
  "_source":{
    "blog_id":"12",
    "post_content":"Hungarian DJ/producer duo Myon &amp; Shane 54 have been making quite the name for themselves over the past few years with their infectious mash-ups and crazy energetic sound. First setting the world alight with tracks on Armada and Anjunabeats, the two are now popping well-crafted tunes on their Ride Recordings imprint. Always showcasing new tunes on their weekly radio show International Departures, the two have just recently announced the \"Summer Of Love\" tour.\r\n\r\nThe Summer of Love name is no stranger to MS54 fans. The duo has been shelling out remixes under the moniker for many of their popular edits including \"Young & Beautiful\" by Lana Del Rey, \"The Great Divide\" by Velvetine, and \"Sea Lo Que Sea Será\" by Above &amp; Beyond and Miguel Bosé. First invading the shores of Australia, the tour will then head over North America, hitting cities all across Canada and the United States.\r\n\r\nReadying the release of new music as well as additional tour dates, you can expect that the \"Summer Of Love\" tour will be just as massive as the remixes of the same name. Join Disco Donnie Presents as we bring Myon &amp; Shane 54's \"Summer of Love\" tour to a city near you:\r\n\r\n\tMyon &amp; Shane 54 in Charlotte, NC on Friday, August 22nd\r\n\tMyon &amp; Shane 54 in Dallas, TX on Sunday, August 24th\r\n\tMyon &amp; Shane 54 in San Antonio, TX on Friday, September 12nd\r\n\tMyon &amp; Shane 54 in Houston, TX on Saturday, September 13th\r\n\r\n\r\n[soundcloud url=\"https://api.soundcloud.com/tracks/65866000\" params=\"color=ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false\" width=\"100%\" height=\"166\" iframe=\"true\" /]\r\n\r\n[soundcloud url=\"https://api.soundcloud.com/tracks/134009094\" params=\"color=ff5500&auto_play=false&hide_related=false&show_comments=true&show_user=true&show_reposts=false\" width=\"100%\" height=\"166\" iframe=\"true\" /]",
    "post_title":"Have a 'Summer of Love' With Myon & Shane 54 and Disco Donnie Presents",
    "post_date":"2014-07-19T12:40:56+00:00",
    "category":[
      "updates"
    ],
    "category_name":[
      "Updates"
    ],
    "post_tag":[

    ],
    "post_format":[

    ],
    "addedTo": "_source - added the following fields",
    "featured_image": "http://lorempixel.com/1024/767/",
    "permalink": "http://discodonniepresents.com/get-knocked-bingo-players-disco-donnie-presents"
  }
}